{
  "vacancy": "Python developer",
  "link": "https://spb.hh.ru/vacancy/104729022?query=python&hhtmFrom=vacancy_search_list",
  "salary": "Доход не указан",
  "name_company": "АНО ЦИСМ",
  "city": "Москва",
  "text": "Центр изучения и сетевого мониторинга молодёжной среды – аккредитованная IT-компания, учреждённая по поручению Президента России в октябре 2018 года. Деятельность организации ориентирована на создание IT-решений, направленных на формирования комплексной системы по защите детей и подростков от воздействия негативной информации в сети.Мы ищем в нашу команду Python разработчика Обязанности:  Написание высоконагруженных приложений и микросервисов на Python Участие в разработке уже имеющихся приложений в составе команды Участие в принятии архитектурных решений по проекту Поддержка и развитие созданных решений Написание unit-тестов на PyTest  Что мы ожидаем от Вас:   Опыт работы с реляционными базами данных. Используем мы их много и, поэтому мы ожидаем что вы знакомы с транзакциями, блокировками, индексами и тд   Опыт работы с MySQL и/или PostgreSQL   Опыт работы с multiprocessing, очередями задач (RabbitMQ, Kafka), Celery и аналогами, понимание асинхронности   Опыт построения ETL/ELT pipelines.   Умение грамотно оформлять сложную бизнес-логику в виде кода, желание покрывать свой код тестами   Опыт работы с Django. Знание особенностей orm-а, лучших практик и проблем   Будет плюсом понимание Clean Architecture, DDD, SOLID   Условия:  Конкурентный уровень з/п, размер обсуждается по итогам собеседования и квалификации Официальное оформление по ТК РФ Удаленная работа Гибкое начало рабочего дня, график 5/2, выходные: суббота/воскресенье Непрерывное обучение и развитие профессиональных навыков Доступно соискателям с инвалидностью Ключевые навыкиPythonFlaskDjangoFastAPISQLPostgreSQLNoSQLRabbitMQЗадайте вопрос работодателюОн получит его с откликом на вакансиюГде располагается место работы?Какой график работы?Вакансия открыта?Какая оплата труда?Как с вами связаться?Другой вопрос"
}{
  "vacancy": "Python-разработчик",
  "link": "https://spb.hh.ru/vacancy/104276440?query=python&hhtmFrom=vacancy_search_list",
  "salary": "200000 – 220000 ₽",
  "name_company": "ООО Ритейл-Процессинг",
  "city": "Москва",
  "text": "Наша команда поддерживает все сервисы компании — Smart Kit, Smart Pay, Ecom Kit. Это значительные нагрузки и современные технологии. Мы ищем разработчика, с опытом промышленной разработки и отличным знанием Python. Обязанности:   Доработки платежного сервиса и сервиса SmartKit   Управление облачной инфраструктурой платежного сервиса (Yandex.Cloud, k8s)   Настройка мониторингов   Требования:   Хорошее знание Python, опыт промышленной разработки от 2 года   Опыт использования одного фреймворков - Django, Flask, FastAPI   Опыт асинхронной разработки, использования asyncio (aioredis, asyncpg)   Хорошее знание Linux, умение пользоваться командной строкой   Умение на прямую работать с базой (SQL)   Опыт работы с облачной инфраструктурой DO, GCP, AWS, Yandex.Cloud   Будет преимуществом:   Знание Docker, k8s   Настройка CI/CD на основе Gitlab   Опыт разработки платежных сервисов   Понимание принципов работы с базами данных   Условия:   Аккредитованная IT компания   Работа в молодой и динамичной компании, сложные и интересные задачи   Официальное трудоустройство   Уютный стильный офис   Поддержка коллег и руководителя  Ключевые навыкиPythonSQLDockerDjangoFlaskАнглийский — B1 — СреднийЗадайте вопрос работодателюОн получит его с откликом на вакансиюГде располагается место работы?Какой график работы?Вакансия открыта?Какая оплата труда?Как с вами связаться?Другой вопросАдресКалининград, Советский проспект, 234Показать на большой карте"
}{
  "vacancy": "Senior python developer",
  "link": "https://spb.hh.ru/vacancy/104478742?query=python&hhtmFrom=vacancy_search_list",
  "salary": "Доход не указан",
  "name_company": "AldanDev",
  "city": "Москва",
  "text": "Мы AldanDev - venture builder, запущенный крупнейшим отечественным инвестиционным фондом Kama Flow для поддержки передовых инновационных идей. Совместно с индустриальными партнерами и ведущими центрами компетенций создаем компании с потенциалом быстрого роста в сфере информационных технологий, промышленных инноваций, наук о жизни. В портфеле – проекты научных и инженерных команд, разрабатывающих продукты и решения, конкурентоспособные на международных рынках. Мы ищем опытного специалиста, который в перспективе возьмёт на себя ключевую техническую роль на проекте. Тебе предстоит:  Организация командной работы; Непосредственное участие в разработке; Ведение ключевых scrum активностей; Code Review, ответственность за качество кода.  Мы ждем от тебя:  Уверенное владение Python; Опыт администрирования Linux; Владение react, typescript, next js будет большим плюсом; Опыт коммерческой разработки от 3х лет; Умение системно организовывать процессы.  Наш стек:  python 3.11 postgres docker + kubernetes yandex cloud  Мы предлагаем:  Официальное трудоустройство согласно ТК РФ; Возможность работать удаленно с готовностью работать по Московскому времени; Работа над масштабными зарубежными проектами; Возможность участия в опционной программе после прохождения ИС. Ключевые навыкиPythonFlaskDjangoРабота с базами данныхHTTPSQLРабота с большим объемом информацииОбучение и развитиеREST APIBackendЗадайте вопрос работодателюОн получит его с откликом на вакансиюГде располагается место работы?Какой график работы?Вакансия открыта?Какая оплата труда?Как с вами связаться?Другой вопрос"
}{
  "vacancy": "Ведущий разработчик Python",
  "link": "https://spb.hh.ru/vacancy/104470130?query=python&hhtmFrom=vacancy_search_list",
  "salary": "Доход не указан",
  "name_company": "ООО МАС Платформ",
  "city": "Москва",
  "text": "Мы ищем т опытного middle/senior разработчика на Python, который будет участвовать в активном развитии наших собственных коммерческих продуктов. Предлагаем минимум легаси, дорожную карту из новых фич, наличие R&D задач, ясных продуктовых целей и достойную оплату. Требования:  Опыт работы с Python: не менее 3-5 лет разработки на Python в продакшене, готовность рассказать о проектах и показать примеры кода и принятых решений. Опыт разработки: участие в разработке систем с распределенной нагрузкой, асинхронной обработкой очереди задач. Технический стек: уверенные знания Django/Flask, взаимодействие со сторонними системами через REST API, очереди, PostgreSQL/MySQL, базовые знания ОС Linux. Знание принципов безопасной разработки: понимание принципов обеспечения безопасности приложений, включая защиту паролей и токенов, надежную аутентификацию и передачу конфиденциальной информации пользователь-программа и программа-программа, работу с потенциально-опасным пользовательским вводом, управление зависимостями, выявление и устранение потенциальных уязвимостей в коде. Знание архитектурных паттернов и алгоритмов: способность самостоятельно принимать решения, выбирая наиболее эффективные алгоритмы и архитектуры для обеспечения скорости разработки, комфортной поддержки продукта, простого и ясного кода. Опыт работы с DevOps инструментами: умение работать с git, понимание смысла CI/CD процессов, контейнеризации (Docker) для разработки и продакшена. Работа в команде: опыт работы с системами управления задачами и умение их эффективно использовать для синхронизации с командой (напр.: Яндекс.Трекер, Jira); умение своевременно сообщать о проблемах и предлагать решения, четко и ясно доносить своё мнение, мысли, предложения, а также передавать знания и объяснять принятые решения с целью наполнения документации и справок. Самостоятельность: умение эффективно распределять время для выполнения задач с учётом приоритетов, зависимостей и неизвестности, выделять повторяющиеся/рутинные действия и автоматизировать их ради собственной эффективности и развития команды в целом. Навыки тестирования: умение писать юнит-тесты, выявлять и исправлять ненадежные участки кода, формировать задания для интеграционных тестов, взаимодействовать со специалистами DevOps для автоматизации сборок, тестов и отчетности.    Что предлагаем:  Нам важен результат, а не то откуда работаете, поэтому можете выбирать офис, гибрид, удаленная работа. Участие в создании новых, технологически сложных продуктов. Наличие переводчика с клиентского языка на язык разработки и обратно.  Финансовую стабильность.   Карьерные возможности.    Ключевые навыкиPythonPostgreSQLDockerDjango FrameworkЗадайте вопрос работодателюОн получит его с откликом на вакансиюГде располагается место работы?Какой график работы?Вакансия открыта?Какая оплата труда?Как с вами связаться?Другой вопросАдресМосква, Деловой центр, Деловой центр, Деловой центр (Выставочная), Пресненская набережная, 12Показать на большой карте"
}